КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ТрН_Титул5/КонтурЛогистика_ТрН_Титул5.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ТрН_Титул5</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументЭТРН</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>будет отображаться только в диадоке, не попадет в ЭтРН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатПУДИнфПрв</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрПУДИнфПрв</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>НомИспр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИспр</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаимДокОснДовОргСост</name>
    <comment>Наименование документа-снования, по которому экономический субъект является составителем файла обмена первичного учетного документа о факте хозяйственной жизни (информации перевозчика)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокОснДовОргСост</name>
    <comment>Номер документа-снования, по которому экономический субъект является составителем файла обмена первичного учетного документа о факте хозяйственной жизни (информации перевозчика)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокОснДовОргСост</name>
    <comment>Дата документа-снования, по которому экономический субъект является составителем файла обмена первичного учетного документа о факте хозяйственной жизни (информации перевозчика)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопСведДокОснДовОргСост</name>
    <comment>Доп. сведения документа-снования, по которому экономический субъект является составителем файла обмена первичного учетного документа о факте хозяйственной жизни (информации перевозчика)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтороныСостДокОснДовОргСост</name>
    <comment>Стороны составители документа-снования, по которому экономический субъект является составителем файла обмена первичного учетного документа о факте хозяйственной жизни (информации перевозчика)</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_СтороныСоставители</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСостДокОснДовОргСост</name>
    <comment>Доп. составитель документа-снования, по которому экономический субъект является составителем файла обмена первичного учетного документа о факте хозяйственной жизни (информации перевозчика)</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдДокОснДовОргСост</name>
    <comment>Идентификатор документа-снования, по которому экономический субъект является составителем файла обмена первичного учетного документа о факте хозяйственной жизни (информации перевозчика)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатПодп</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписанта</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдФайлПрвВыд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатФайлПрвВыд</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрФайлПрвВыд</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьБезНДС</name>
    <comment>Стоимость перевозки без налога – всего</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьСНДС</name>
    <comment>Стоимость перевозки с налогом – всего</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокРасчета</name>
    <comment>Порядок (механизм) расчета (исчислений) платы¶</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурноеПодразделение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокИспользованияФайлаОбмена</name>
    <comment>Информация для участника документооборота</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНазвание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеБанка</name>
    <comment>Наименование банка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БИК</name>
    <comment>Банковский идентификационный код (БИК)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорСчет</name>
    <comment>Корреспондентский счет банка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтметкиИнфПол</name>
    <attributes>
      <name>ИдФайлИнфПол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстИнфИдентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстИнфЗначение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Время по МСК!</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыТитулов</types>
    </type>
  </resources>
  <resources>
    <name>СтатусПодписи</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписи</types>
    </type>
  </resources>
  <resources>
    <name>ТипОшибки</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыОшибокСтатусаТитула</types>
    </type>
  </resources>
  <resources>
    <name>КодОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь1С</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГП</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2_5_02</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГО</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ДФ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭкспедиторскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул7</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул6</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул8</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СкладскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулПВ</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул6</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Это статусы доставки в Диадок. Логистические статусы смотри в спр. КонтурЛогистика_СостоянияДвиженияДокументооборота</comment>
  <enumValues>
    <name>Пропущен</name>
  </enumValues>
  <enumValues>
    <name>Удален</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленКОтправке</name>
  </enumValues>
  <enumValues>
    <name>СформированыФайлыОбмена</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаРаспечатан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаОтказВПодписи</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершена</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
    <comment>для титулов, которые были загружены из Диадока</comment>
  </enumValues>
  <enumValues>
    <name>ПолученТребуетОбработки</name>
  </enumValues>
  <enumValues>
    <name>ПолученОбработанСПредупреждением</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ТрН_Титул5/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения", ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("ТрН_Титул5_ПередЗаписью_После", Истина, ПараметрыПМ);
	Отказ = ?(Отказ <> ПараметрыПМ.Отказ, ПараметрыПМ.Отказ, Отказ);	// Если признак отказа был изменен в ПМ, то пробрасываем его значение
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда
		
		ФайлСсылка = ДанныеЗаполнения;
		ТекстФайла = ФайлСсылка.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ФайлСсылка + " нет текста титула");
			Возврат;
		КонецЕсли;

		ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка);
		
	ИначеЕсли ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ПредыдущийТитул")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ПредыдущийТитул) Тогда
		
		ЗаполнитьПоПредыдущемуТитулу(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();	
		
	КонецЕсли;
	
	// ПМ на изменение документа
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ТрН_Титул5_ОбработкаЗаполнения_После",
		Истина,
		ЭтотОбъект);
		
КонецПроцедуры

Процедура ЗаполнитьИзФайлаОбмена(Знач ТекстФайла, Знач ФайлСсылка)
	
	НайденныйДокументЭТРН = КонтурЛогистика_ОбработкаДокументовСервер.НайтиГлавныйДокументПоФайлу(ФайлСсылка);
	
	Если Не ЗначениеЗаполнено(НайденныйДокументЭТРН) Тогда 
		
		Сообщить("При создании титула по файлу " + ФайлСсылка + "не смог найти Документ ЭТРН, создание не выполнено");
		
	Иначе
		
		ДокументЭТРН = НайденныйДокументЭТРН;
		XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
		
		ЗаполнитьРеквизитыТитулаИзXDTO(XDTO);
		
		// Комментарий - нет в формате минтранса // TODO есть в Диадоке - научиться доставать из ДД 
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПоПредыдущемуТитулу(Знач ДанныеЗаполнения)
	
	// Предыдущий титул может быть любым титулом в цепочке (точно может быть Т2, Т3, Т4)
	// В соотв. с логикой ГИС требуется всегдя ссылаться на Т2 (с учетом исправлений на последнюю редакцию)
	ПредыдущийТитул = ДанныеЗаполнения.ПредыдущийТитул;
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		ДанныеЗаполнения.ТипЛогистика);
	
	ДокументЭТРН = ПредыдущийТитул.ДокументЭТРН;
	
	ЗаполнитьУказателиНаПредыдущийТитул(ПредыдущийТитул);
	
	ИнфПол.Очистить();
	ОтметкиИнфПол.Очистить();
	
	ЗаполнитьЧерезНастройкиКонвертации(КонтекстНастройкиКонвертации);
	
	// если была заказ(заявка) и там были сведения о стоимости то взять их
	Если ЗначениеЗаполнено(ДокументЭТРН) И ЗначениеЗаполнено(ДокументЭТРН.ЗаказЗаявкаОснование) Тогда
		
		НайденныйЗЗт2 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиЗЗтитул2(ДокументЭТРН.ЗаказЗаявкаОснование);
		
		Если ЗначениеЗаполнено(НайденныйЗЗт2.СтТовБезНДС)
			И Не ЗначениеЗаполнено(СтоимостьБезНДС) Тогда
			
			СтоимостьБезНДС = НайденныйЗЗт2.СтТовБезНДС;
			СтавкаНДС 		= НайденныйЗЗт2.НалСт;
			СтоимостьСНДС 	= НайденныйЗЗт2.СтТовУчНал;
			СуммаНДС 		= НайденныйЗЗт2.СтТовУчНал - НайденныйЗЗт2.СтТовБезНДС;
			
		КонецЕсли;
			
		Если ЗначениеЗаполнено(НайденныйЗЗт2.Расчет) И Не ЗначениеЗаполнено(ПорядокРасчета) Тогда
			ПорядокРасчета 	= НайденныйЗЗт2.Расчет;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьУказателиНаПредыдущийТитул(Знач ПредыдущийТитул) Экспорт
		
	Титул4 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4, ДокументЭТРН);
	ФайлТитула4 = Справочники.КонтурЛогистика_ФайлыОбмена.ПервыйНеошибочныйФайлДокумента(Титул4);
	
	ИдФайлПрвВыд	= СтрЗаменить(ФайлТитула4.ИмяФайла, ".xml", "");;
	ДатФайлПрвВыд	= Титул4.ДатИнфПрвВыд;
	ВрФайлПрвВыд	= Титул4.ВрИнфПрвВыд;
	
	ДвоичныеДанныеПодписи 	= ФайлТитула4.Подпись.Получить();
	ЭП 						= Base64Строка(ДвоичныеДанныеПодписи);

КонецПроцедуры

Процедура ЗаполнитьЧерезНастройкиКонвертации(КонтекстНастройкиКонвертации)
	
	Если КонтекстНастройкиКонвертации.ЕстьКонвертация Тогда
		КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(
			ЭтотОбъект, КонтекстНастройкиКонвертации);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоПользователю() Экспорт
	
	Попытка
		
		// Поиск подписанта в настройках подписания по дополнительному параметру.
		Если Не ЗначениеЗаполнено(ПользовательПодписант) И ЗначениеЗаполнено(ПараметрНастроекПодписания) Тогда
			ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
				ДокументЭТРН.Перевозчик,,, ЭтотОбъект, ПараметрНастроекПодписания);
			
			ПользовательПодписант = ДанныеПодписанта.Пользователь1С;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) Тогда 
			ПользовательПодписант = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		// TODO дефолты, зависящие от Пользователя
		
	Исключение
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("ЗаполнитьРеквизитыПоПользователю", ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTO(Знач XDTO)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Документ = КС.XDTO_Вычислить(XDTO, "Документ");
	
	ДатПУДИнфПрв 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ДатПУДИнфПрв"));
	ВрПУДИнфПрв 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ВрПУДИнфПрв"));
	      	
	// Основание, по которому экономический субъект является составителем файла обмена
	XDTO_ОснДовОргСост 	= КС.XDTO_Вычислить(Документ, "ОснДовОргСост");
	
	НаимДокОснДовОргСост 	= КС.XDTO_Вычислить(XDTO_ОснДовОргСост, "НаимДок");
	НомерДокОснДовОргСост 	= КС.XDTO_Вычислить(XDTO_ОснДовОргСост, "НомерДок");
	ДатаДокОснДовОргСост 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(XDTO_ОснДовОргСост, "ДатаДок"));
	ДопСведДокОснДовОргСост = КС.XDTO_Вычислить(XDTO_ОснДовОргСост, "ДопСведДок");
	ИдДокОснДовОргСост		= КС.XDTO_Вычислить(XDTO_ОснДовОргСост, "ИдДок");
	
	МассивСторон =  КС.Конвертировать_ИдРекСостТип_вМассивСторонСоставителей(КС.XDTO_Вычислить(XDTO_ОснДовОргСост, "ИдРекСост"));
	Составители = Перечисления.КонтурЛогистика_СтороныСоставители.СоставителиИзМассиваСторон(ДокументЭТРН, МассивСторон);
	
	СтороныСостДокОснДовОргСост = Составители.Составитель;
	ДопСостДокОснДовОргСост 	= Составители.ДопСоставитель;

	// Данные Подписанта
	XDTO_Подписант 		= КС.XDTO_Вычислить(Документ, "Подписант");
	
	Должность 	= КС.XDTO_Вычислить(XDTO_Подписант, "Должн");
	Фамилия 	= КС.XDTO_Вычислить(XDTO_Подписант, "ФИО.Фамилия");
	Имя 		= КС.XDTO_Вычислить(XDTO_Подписант, "ФИО.Имя");
	Отчество 	= КС.XDTO_Вычислить(XDTO_Подписант, "ФИО.Отчество");
	
	СтатПодп_raw = КС.XDTO_Вычислить(XDTO_Подписант, "СтатПодп");
	СтатПодп = Перечисления.КонтурЛогистика_СтатусыПодписанта.ЗначениеИзXDTO(СтатПодп_raw);
		
	// Идентификация файла обмена информации перевозчика о выдаче груза грузополучателю
	XDTO_ИдИнфПрвВыд 	= КС.XDTO_Вычислить(Документ, "ИдИнфПрвВыд");
	
	ИдФайлПрвВыд 	= КС.XDTO_Вычислить(XDTO_ИдИнфПрвВыд, "ИдФайлПрвВыд"); 
	ДатФайлПрвВыд 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(XDTO_ИдИнфПрвВыд, "ДатФайлПрвВыд"));
	ВрФайлПрвВыд 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(XDTO_ИдИнфПрвВыд, "ВрФайлПрвВыд"));
	ЭП 				= КС.XDTO_Вычислить(XDTO_ИдИнфПрвВыд, "ЭП");
	
	// Содержание факта хозяйственной жизни 1 
	XDTO_СодФХЖ1 		= КС.XDTO_Вычислить(Документ, "СодФХЖ1");
	
	СтоимостьБезНДС = КС.XDTO_ВычислитьЧисло(XDTO_СодФХЖ1, "СтТовБезНДС");
	СтоимостьСНДС	= КС.XDTO_ВычислитьЧисло(XDTO_СодФХЖ1, "СтТовУчНал");
	ПорядокРасчета	= КС.XDTO_Вычислить(XDTO_СодФХЖ1, "Расчет");
	
	СтавкаНДС_raw 	= КС.XDTO_Вычислить(XDTO_СодФХЖ1, "НалСт");
	Если СтавкаНДС_raw <> Неопределено Тогда 
		СтавкаНДС 	= Перечисления.КонтурЛогистика_СтавкиНДС.СтавкаНДСПоПредставлению(СтавкаНДС_raw);
	КонецЕсли;
	
	XDTO_СумНал	= КС.XDTO_Вычислить(XDTO_СодФХЖ1, "СумНал");
	СуммаНДС 	= КС.XDTO_ВычислитьЧисло(XDTO_СумНал, "СумНДС");
	ЭтоБезНДС	= КС.XDTO_Вычислить(XDTO_СумНал, "БезНДС") = "без НДС";
	Если ЭтоБезНДС Тогда
		СтавкаНДС = Перечисления.КонтурЛогистика_СтавкиНДС.БезНДС;
	КонецЕсли;
		
	// Исправление первичного учетного документа
	XDTO_ИспрПУД 	= КС.XDTO_Вычислить(XDTO_СодФХЖ1, "ИспрПУД");
	
	НомИспр			= КС.XDTO_Вычислить(XDTO_ИспрПУД, "НомИспр");
	ДатаИспр		= КС.XDTO_Вычислить(XDTO_ИспрПУД, "ДатаИспр");
	
	// Дополнительные сведения об участнике факта хозяйственной жизни
	XDTO_ДопСвПрв = КС.XDTO_Вычислить(XDTO_СодФХЖ1, "ДопСвПрв");
	
	ОКПО 			= КС.XDTO_Вычислить(XDTO_ДопСвПрв, "ОКПО");
	КраткоеНазвание = КС.XDTO_Вычислить(XDTO_ДопСвПрв, "КраткНазв");
	
	СтруктурноеПодразделение 			= КС.XDTO_Вычислить(XDTO_ДопСвПрв, "СтруктПодр");
	ПорядокИспользованияФайлаОбмена 	= КС.XDTO_Вычислить(XDTO_ДопСвПрв, "ИнфДляУчаст");
		
	// Банковские реквизиты
	XDTO_БанкРекв = КС.XDTO_Вычислить(XDTO_ДопСвПрв, "БанкРекв");
	
	НомерСчета 			= КС.XDTO_Вычислить(XDTO_БанкРекв, "НомерСч");
	НаименованиеБанка	= КС.XDTO_Вычислить(XDTO_БанкРекв, "СвБанк.НаимБанк");
	БИК					= КС.XDTO_Вычислить(XDTO_БанкРекв, "СвБанк.БИК");
	КорСчет				= КС.XDTO_Вычислить(XDTO_БанкРекв, "СвБанк.КорСчет");
	
КонецПроцедуры

Функция СформироватьФайлОбмена(ПараметрыФайлаРеквизиты = Неопределено) Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("МассивФайловОбмена", Новый Массив);
	Результат.Успешно = Истина;
	
	Попытка
	
		Заблокировать();
	
	Исключение
		
		Результат.Успешно = Ложь;
	    Результат.ОписаниеОшибки = "Не удалось заблокировать документ: " + ОписаниеОшибки();
		Возврат Результат;
		
	КонецПопытки;
	
	// Проверка статуса после наложения блокировки на Документ
	РезультатПроверкиСтатуса = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьТекущийСтатусДокументаДляСозданияФайловОбмена(Ссылка);
	
	Если НЕ РезультатПроверкиСтатуса.Успешно Тогда
		Разблокировать();
		Возврат РезультатПроверкиСтатуса;
	КонецЕсли;
	
	// Выполнить валидацию документа
	РезультатВалидации = Документы.КонтурЛогистика_ТрН_Титул5.ПроверитьДокумент(Ссылка);
	
	Если РезультатВалидации.КоличествоОшибок > 0 Тогда
		
		Разблокировать();
		Результат.ОписаниеОшибки = "Ошибки в " + Ссылка + "! Исправьте их для отправки.";
		Результат.Успешно = Ложь;
		Возврат Результат;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		ДатПУДИнфПрв = ТекущаяДатаСеанса();
		ВрПУДИнфПрв = ТекущаяДатаСеанса();
		
		// формируем текст xml
		РезультатФормированияТекста = СформироватьТекстФайла(ДатПУДИнфПрв, ВрПУДИнфПрв);
		Если РезультатФормированияТекста.Успешно = Ложь Тогда
					
			Результат.Успешно = Ложь;
			Результат.МассивОшибок.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатФормированияТекста));
			Возврат Результат;
					
		КонецЕсли;
		
		// запишем в справочник
		РезультатСозданияФайла = Справочники.КонтурЛогистика_ФайлыОбмена.СоздатьФайлОбмена(
										РезультатФормированияТекста,
										Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул5,
										ПараметрыФайлаРеквизиты,
										Ссылка);
				
		ЗаполнитьЗначенияСвойств(Результат, РезультатСозданияФайла);
		
		Если Результат.Успешно Тогда
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, 
				Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена, , Истина);
			
			Результат.МассивФайловОбмена.Добавить(РезультатСозданияФайла.Файл);
			
		Иначе
			
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(Результат);
			
		КонецЕсли;
		
		Записать(); // запишем  ДатИнфПрвПрием и ВрИнфПрвПрием
		
		Разблокировать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Разблокировать();
		Результат.Успешно = Ложь;
		Результат.Массивошибок.Добавить("Ошибка при формировании файла обмена по документу " + Ссылка + ": " + ОписаниеОшибки());
		
		КонтекстМетода = Новый Структура;
		КонтекстМетода.Вставить("ПараметрыФайлаРеквизиты", ПараметрыФайлаРеквизиты);
		КонтекстМетода.Вставить("РезультатСозданияФайла", РезультатСозданияФайла);
		
		КонтурЛогистика_Метрика.ОбработатьОшибкуФормированияТекстаФайла(Ссылка, ИнформацияОбОшибке(), КонтекстМетода);
		
	КонецПопытки;
	
	Возврат Результат;
		
		
КонецФункции 

Функция СформироватьТекстФайла(ДатаФормирования, ВремяФормирования)
	
	НомерТитула = 5;
	Формат = "5.01";
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");
	
	XDTO_Файл = КС.XDTO_ФайлОбмена(НомерТитула);
	GUID = Строка(Новый УникальныйИдентификатор);
	
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаТитулаТРН(НомерТитула, 
												ДокументЭТРН.Грузоотправитель,
												ДокументЭТРН.Перевозчик,
												ДокументЭТРН.Грузополучатель,
												GUID); 
	Результат.Вставить("ИдФайл",		XDTO_Файл.ИдФайл);
	
	ПодписантСтруктура 	= РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		ДокументЭТРН.Перевозчик, ПользовательПодписант, Неопределено, ЭтотОбъект, ПараметрНастроекПодписания);
	
	XDTO_Подписант 		= КС.XDTO_Подписант(НомерТитула, , Формат, ПодписантСтруктура, неопределено);
	КС.XDTO_Подписант_СформироватьСведенияМЧД(НомерТитула, XDTO_Подписант, ПодписантСтруктура, Результат);
		
	XDTO_Файл.Документ	= КС.XDTO_Документ(НомерТитула, , Формат, XDTO_Подписант, ДатаФормирования, ВремяФормирования);
	
	КС.XDTO_Установить(XDTO_Файл.Документ, "НаимЭкСубСост", ДокументЭТРН.Перевозчик.НаименованиеОрганизацииПолное);
	
	Если ЗначениеЗаполнено(ИдДокОснДовОргСост) Или ЗначениеЗаполнено(НаимДокОснДовОргСост) Тогда 
	
		Составители = КС.Массив_XDTO_СоставителиДокумента(НомерТитула, ДокументЭТРН, СтороныСостДокОснДовОргСост, ДопСостДокОснДовОргСост);
		XDTO_ОснДовОргСост = КС.XDTO_РеквДокТип(НомерТитула,
												НаимДокОснДовОргСост,
												НомерДокОснДовОргСост,
												ДатаДокОснДовОргСост,
												ИдДокОснДовОргСост,
												ДопСведДокОснДовОргСост,
												Составители);
												
		КС.XDTO_Установить(XDTO_Файл.Документ, "ОснДовОргСост", XDTO_ОснДовОргСост);
	
	КонецЕсли;
	
	XDTO_СодФХЖ1 = КС.XDTO_СодФХЖ1(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "СодФХЖ1", XDTO_СодФХЖ1);
	
	XDTO_ИдИнфПрвВыд = КС.XDTO_ИдИнфПрвВыд(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "ИдИнфПрвВыд", XDTO_ИдИнфПрвВыд);
	
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл);
	
	Результат.Вставить("ТекстФайла",ТекстФайла);
	Результат.Вставить("GUID",		GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
